## What's about to be deployed:
---------------------------------
``` 
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # aws_api_gateway_rest_api.mdata-api[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_api_gateway_rest_api" "mdata-api" {
      [32m+[0m [0m[1m[0mapi_key_source[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0marn[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0mbinary_media_types[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mcreated_date[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mdescription[0m[0m                  = "API created from terraform"
      [32m+[0m [0m[1m[0mdisable_execute_api_endpoint[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mexecution_arn[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                           = (known after apply)
      [32m+[0m [0m[1m[0mminimum_compression_size[0m[0m     = -1
      [32m+[0m [0m[1m[0mname[0m[0m                         = "mdata"
      [32m+[0m [0m[1m[0mpolicy[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0mroot_resource_id[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mtags_all[0m[0m                     = (known after apply)

      [32m+[0m [0mendpoint_configuration {
          [32m+[0m [0m[1m[0mtypes[0m[0m            = [
              [32m+[0m [0m"REGIONAL",
            ]
          [32m+[0m [0m[1m[0mvpc_endpoint_ids[0m[0m = (known after apply)
        }
    }

[0m[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now. ```